{
  "commitments": [
    {
      "title": "Commitment 1: Taking Radical Responsibility",
      "description": "I commit to taking full responsibility for the circumstances of my life and for my physical, emotional, mental, and spiritual well-being. I commit to supporting others to take full responsibility for their lives."
    },
    {
      "title": "Commitment 2: Learning through Curiosity",
      "description": "I commit to growing in self-awareness. I commit to regarding every interaction as an opportunity to learn. I commit to curiosity as a path to rapid learning."
    },
    {
      "title": "Commitment 3: Feeling all Feelings",
      "description": "I commit to feeling my feelings all the way through to completion. They come, and I locate them in my body then move, breathe and vocalize them so they release all the way through."
    },
    {
      "title": "Commitment 4: Speaking Candidly",
      "description": "I commit to saying what is true for me. I commit to being a person to whom others can express themselves with candor."
    },
    {
      "title": "Commitment 5: Eliminating Gossip",
      "description": "I commit to ending gossip, talking directly to people with whom I have a concern, and encouraging others to talk directly to people with whom they have an issue or concern."
    },
    {
      "title": "Commitment 6: Practicing Integrity",
      "description": "I commit to the masterful practice of integrity, including acknowledging all authentic feelings, expressing the unarguable truth, keeping my agreements, and taking 100% responsibility."
    },
    {
      "title": "Commitment 7: Generating Appreciation",
      "description": "I commit to living in appreciation, fully opening to both receiving and giving appreciation."
    },
    {
      "title": "Commitment 8: Excelling in your Zone of Genius",
      "description": "I commit to expressing my full magnificence and to supporting and inspiring others to fully express their creativity and live in their zone of genius."
    },
    {
      "title": "Commitment 9: Living a Life of Play and Rest",
      "description": "I commit to creating a life of play, improvisation, and laughter. I commit to seeing all of life unfold easefully, and effortlessly. I commit to maximizing my energy by honoring rest, renewal, and rhythm."
    },
    {
      "title": "Commitment 10: Exploring the Opposite",
      "description": "I commit to seeing that the opposite of my story is as true or truer than my original story. I recognize that I interpret the world around me and give my stories meaning."
    },
    {
      "title": "Commitment 11: Sourcing Approval, Control and Security",
      "description": "I commit to being the source of my approval, control, and security."
    },
    {
      "title": "Commitment 12: Having Enough of Everything",
      "description": "I commit to experiencing that I have enough of everything... including time, money, love, energy, space, resources, etc."
    },
    {
      "title": "Commitment 13: Experiencing the World as an Ally",
      "description": "I commit to seeing all people and circumstances as allies that are perfectly suited to help me learn the most important things for my growth."
    },
    {
      "title": "Commitment 14: Creating Win for all Solutions",
      "description": "I commit to creating win-for-all solutions (win for me, win for the other person, win for the organization, and win for the whole) for whatever issues, problems, concerns, or opportunities life gives me."
    },
    {
      "title": "Commitment 15: Being the Resolution",
      "description": "I commit to being the resolution or solution that is needed: seeing what is missing in the world as an invitation to become that which is required."
    }
  ]
}
